
#2) კომენტარების სახით ახსენით ყველა მათემატიკური ოპერატორი, რა განსხვავებაა / და // ოპერატორებს შორის
# + რიცხვების ჯამი, მიმატება
# - რიცხვების სხვაობა, გამოკლება
# * გამრალება
# / გაყოფა, რომელიც ზუსტ შედეგს გვაძლევს
# // გაყოფა შედეგს გვაძლევს ნაშთის გარეშე
# %  შედეგს გვაძლევს ნაშთს
# ** ხარისხში აყვანა
# / და // ოპერატორებს შორის განსხვავება არის, რომ პირველი გვაძლევს ზუსტ შედეგს ხოლო მეორე მთელ რიცხვს ნაშთის ჩვენების გარეშე.
#3) შექმენით ორი ცვლადი a = 7, b = 5 და დაბეჭდეთ: • ჯამი • სხვაობა • ნამრავლი • გაყოფის შედეგი • მთელრიცხვიანი გაყოფა • ხარისხი (a ხარისხად b) • ნაშთი
a = 7
b = 5
print(a + b)  # ჯამი
print(a - b)  # სხვაობა
print(a * b)  # ნამრავლი
print(a / b)  # გაყოფის შედეგი
print(a // b)  # მთელრიცხვიანი გაყოფა
print(a ** b)  # ხარისხი (a ხარისხად b)
print(a % b)  # ნაშთი

#4) შექმენი ცვლადი სახელად price მნიშვნელობით 49. გამოაკელი 12 და დაბეჭდე შედეგი (ყოველ ცვლილებაზე უნდა ნახლდებოდეს ცვლადი)
price = 49
price -= 12  # ეს გამოკლების ოპერატორი და იგივეა რაც price = price - 12
print(price)
price = price - 12
print(price)
#5) შექმენი ცვლადი სახელად score მნიშვნელობით 100. შეცვალეთ მისი მნიშვნელობა:გაამრავლეთ 35 ზე და დაბეჭდეთ შედეგი
score = 100
score = score * 35
print(score)
#6) ახსენით რა შედეგს გამოიტანს ეს კოდი და რატომ. print(name) გამოძახები შემდგომ პასუხი ქინება 'Sally' რადგან ბოლო მნიშვნელობა რომელიც ცვლადს name მიენიჭა არის 'Sally'.
name = 'Barbare'
name = 'Lika'
name = 'Sally'
#name = 'Ninia'
print(name)