# / ოპერატორი არის გაყოფა შედეგს მოგვცემს ზუსტს , // გაყოფა ნაშთის გარეშე.
# დებაგინგი არის კოდის შეცდომების პოვნა და გამოსწორება
# + 
print(5 + 3) 
# -
print(5 - 3) 
# *
print(5 * 3)
# /
print(5 / 3)
# **
print(5 ** 3)
# //
print(5 // 3)
# %
print(5 % 3)
print(5 % 2)
age = 35
print((age + 35 - 20) *  20)

#1academy = ‘GOA”  # უნდა დავწეროთ ერთნაირი ბრჭყალები და არ შეიძება რიცხვით დაწყება 
#group$ = ’200   # ბრჭყალებით არის დასასრულებელი და $ ამოსაღები
#prin(1academy) # t სჭიდება პრინტს და ცვლადია გასასწორებელი
#print(group$  # ფრჩხილებია დასახური

academy = "GOA"
group = "200"
print(academy)
print(group)